webapp-osgeolive/src/main/webapp/static/examples/sos_v20/requests_soap/DescribeSensor.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope 
    http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
  <env:Body>
    <swes:DescribeSensor
        service="SOS"
        version="2.0.0"
        xmlns:swes="http://www.opengis.net/swes/2.0"
        xmlns:gml="http://www.opengis.net/gml/3.2"
        xmlns:swe="http://www.opengis.net/swe/2.0"
        xsi:schemaLocation="http://www.opengis.net/swes/2.0 
        http://schemas.opengis.net/swes/2.0/swes.xsd 
        http://www.opengis.net/swe/2.0 
        http://schemas.opengis.net/sweCommon/2.0/swe.xsd">
      <!-- 
      <swes:extension xsi:type="swe:BooleanPropertyType">
        <swe:Boolean>
          <swe:identifier>returnHumanReadableIdentifier</swe:identifier>
          <swe:value>true</swe:value>
        </swe:Boolean>
      </swes:extension>
       -->
      <swes:procedure>52NorthWS1</swes:procedure>
      <swes:procedureDescriptionFormat>http://www.opengis.net/sensorML/1.0.1</swes:procedureDescriptionFormat>
      <!-- optional validTime: not set, latest sensor description is returned. -->
      <!-- 
      <swes:validTime>
        <gml:TimeInstant gml:id="validTime">
          <gml:timePosition>2017-03-14T12:00:00.000</gml:timePosition>
        </gml:TimeInstant>
      </swes:validTime>
       -->
       <!--   
      <swes:validTime>
        <gml:TimeInstant gml:id="validTime">
          <gml:timePosition indeterminatePosition="after">2017-03-29T12:00:00</gml:timePosition>
        </gml:TimeInstant>
      </swes:validTime>
       -->
      <!-- 
      <swes:validTime>
        <gml:TimePeriod gml:id="validTime">
          <gml:beginPosition>2017-03-14T12:00:00.000</gml:beginPosition>
                <gml:endPosition>2017-03-15T12:00:00.000</gml:endPosition>
        </gml:TimePeriod>
      </swes:validTime>
       -->
    </swes:DescribeSensor>
  </env:Body>
</env:Envelope>
